# Project Title
### Data Engineering Capstone Project

#### Project Summary
--describe your project at a high level--

The project follows the follow steps:
* Step 1: Scope the Project and Gather Data
* Step 2: Explore and Assess the Data
* Step 3: Define the Data Model
* Step 4: Run ETL to Model the Data
* Step 5: Complete Project Write Up

In [1]:
# Do all imports and installs here
import pandas as pd
import psycopg2
from pyspark.sql import SparkSession
import os
import configparser
from insert_data import insert_fact, insert_dim_imm_per, insert_dim_imm_air, insert_dim_demo_info, insert_dim_demo_stat, insert_dim_temp

### Step 1: Scope the Project and Gather Data

#### Scope 
Explain what you plan to do in the project in more detail. What data do you use? What is your end solution look like? What tools did you use? etc>

The purpose of this project is to see the connection between the temperature of the cities that people immigrate to. We could check the preferred destination cities for immigrants based on the immigration year as well. This data will be used for a BI app.

__Data Used:__
- I94 Immigration Data
- Temperature Data
- Demographics Data

__Tools Used:__
- AWS
    - S3
    - Redshift
- Python
    - PySpark
- Airflow for Pipeline

#### Describe and Gather Data 
Describe the data sets you're using. Where did it come from? What type of information is included?

#### I94 Immigration Data
This data comes from [National Travel and Trourism Office(NTTO)](https://www.trade.gov/national-travel-and-tourism-office). The subject of the data is the immigrants going to the U.S. and the information is gives are where they come from, birth year, gender, visa type, etc.

In [2]:
# Read in the data here
fname = '../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat'
df = pd.read_sas(fname, 'sas7bdat', encoding="ISO-8859-1")

In [3]:
df.head()

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,...,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,6.0,2016.0,4.0,692.0,692.0,XXX,20573.0,NaN,NaN,NaN,...,U,NaN,1979.0,10282016,NaN,NaN,NaN,1.897628e+09,NaN,B2
1,7.0,2016.0,4.0,254.0,276.0,ATL,20551.0,1.0,AL,NaN,...,Y,NaN,1991.0,D/S,M,NaN,NaN,3.736796e+09,00296,F1
2,15.0,2016.0,4.0,101.0,101.0,WAS,20545.0,1.0,MI,20691.0,...,NaN,M,1961.0,09302016,M,NaN,OS,6.666432e+08,93,B2
3,16.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,...,NaN,M,1988.0,09302016,NaN,NaN,AA,9.246846e+10,00199,B2
4,17.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,...,NaN,M,2012.0,09302016,NaN,NaN,AA,9.246846e+10,00199,B2

In [4]:
df.columns

Index(['cicid', 'i94yr', 'i94mon', 'i94cit', 'i94res', 'i94port', 'arrdate',
       'i94mode', 'i94addr', 'depdate', 'i94bir', 'i94visa', 'count',
       'dtadfile', 'visapost', 'occup', 'entdepa', 'entdepd', 'entdepu',
       'matflag', 'biryear', 'dtaddto', 'gender', 'insnum', 'airline',
       'admnum', 'fltno', 'visatype'],
      dtype='object')

In [121]:
fact_immigration = df[['cicid', 'i94yr', 'i94mon', 'i94port', 'arrdate', 'depdate', 'i94mode', 'i94visa']]
fact_immigration.columns = ['cic_id', 'year', 'month', 'dep_city', 'arrival_date', 'dep_date', 'travel_code', 'visa']
fact_immigration['country'] = 'United States'
fact_immigration.head()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,cic_id,year,month,dep_city,arrival_date,dep_date,travel_code,visa,country
0,6.0,2016.0,4.0,XXX,20573.0,NaN,NaN,2.0,United States
1,7.0,2016.0,4.0,ATL,20551.0,NaN,1.0,3.0,United States
2,15.0,2016.0,4.0,WAS,20545.0,20691.0,1.0,2.0,United States
3,16.0,2016.0,4.0,NYC,20545.0,20567.0,1.0,2.0,United States
4,17.0,2016.0,4.0,NYC,20545.0,20567.0,1.0,2.0,United States

In [122]:
dim_immigration_personal = df[['cicid', 'i94cit', 'i94res', 'biryear', 'gender', 'insnum']]
dim_immigration_personal.columns = ['cic_id', 'citizen_country', 'resident_country', 'birthyear', 'gender', 'ins_number']
dim_immigration_personal.head()

   cic_id  citizen_country  resident_country  birthyear gender ins_number
0     6.0            692.0             692.0     1979.0    NaN        NaN
1     7.0            254.0             276.0     1991.0      M        NaN
2    15.0            101.0             101.0     1961.0      M        NaN
3    16.0            101.0             101.0     1988.0    NaN        NaN
4    17.0            101.0             101.0     2012.0    NaN        NaN

In [123]:
dim_immigration_air = df[['cicid', 'airline', 'admnum', 'fltno', 'i94visa', 'visatype']]
dim_immigration_air.columns = ['cic_id', 'airline', 'admin_number', 'flight_number', 'visa', 'visa_type']
dim_immigration_air.head()

   cic_id airline  admin_number flight_number  visa visa_type
0     6.0     NaN  1.897628e+09           NaN   2.0        B2
1     7.0     NaN  3.736796e+09         00296   3.0        F1
2    15.0      OS  6.666432e+08            93   2.0        B2
3    16.0      AA  9.246846e+10         00199   2.0        B2
4    17.0      AA  9.246846e+10         00199   2.0        B2

In [8]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.\
config("spark.jars.repositories", "https://repos.spark-packages.org/").\
config("spark.jars.packages", "saurfang:spark-sas7bdat:2.0.0-s_2.11").\
enableHiveSupport().getOrCreate()

df_spark = spark.read.format('com.github.saurfang.sas.spark').load('../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat')

In [6]:
#write to parquet
df_spark.write.parquet("sas_data")
df_spark=spark.read.parquet("sas_data")

AnalysisException: 'path file:/home/workspace/sas_data already exists.;'

#### Temperature Data
This data comes from [Kaggle](https://www.kaggle.com/berkeleyearth/climate-change-earth-surface-temperature-data), and it shows the temperature in different cities around the world. It's recorded monthly, and the values are the average temperature of that month.

In [8]:
fname = '../../data2/GlobalLandTemperaturesByCity.csv'
df_temp = pd.read_csv(fname)

In [9]:
df_temp.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [124]:
df_temp_us = df_temp[df_temp['Country'] == 'United States']
df_temp_us.columns = ['dt', 'avg_temp', 'avg_temp_uncertainty', 'city', 'country', 'latitude', 'longitude']
df_temp_us.head()

,dt,avg_temp,avg_temp_uncertainty,city,country,latitude,longitude
47555,1820-01-01,2.101,3.217,Abilene,United States,32.95N,100.53W
47556,1820-02-01,6.926,2.853,Abilene,United States,32.95N,100.53W
47557,1820-03-01,10.767,2.395,Abilene,United States,32.95N,100.53W
47558,1820-04-01,17.989,2.202,Abilene,United States,32.95N,100.53W
47559,1820-05-01,21.809,2.036,Abilene,United States,32.95N,100.53W

In [125]:
df_temp_us['dt'] = pd.to_datetime(df_temp_us['dt'])
df_temp_us['month'] = pd.DatetimeIndex(df_temp_us['dt']).month
df_temp_us['year'] = pd.DatetimeIndex(df_temp_us['dt']).year
df_temp_us.head()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,dt,avg_temp,avg_temp_uncertainty,city,country,latitude,longitude,month,year
47555,1820-01-01,2.101,3.217,Abilene,United States,32.95N,100.53W,1,1820
47556,1820-02-01,6.926,2.853,Abilene,United States,32.95N,100.53W,2,1820
47557,1820-03-01,10.767,2.395,Abilene,United States,32.95N,100.53W,3,1820
47558,1820-04-01,17.989,2.202,Abilene,United States,32.95N,100.53W,4,1820
47559,1820-05-01,21.809,2.036,Abilene,United States,32.95N,100.53W,5,1820

#### US Cities Demographics Data
This data comes from [OpenSoft](https://public.opendatasoft.com/explore/dataset/us-cities-demographics/export/), and it shows the demographics of the cities in the U.S. including the population, median age, the state the city belongs to, etc.

In [12]:
fname = './us-cities-demographics.csv'
df_demo = pd.read_csv(fname, delimiter=';')

In [126]:
df_demo.head()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

In [127]:
df_demo_info = df_demo[['City', 'State', 'Male Population', 'Female Population', 'Total Population', 'Number of Veterans', 'Foreign-born', 'State Code', 'Race']]
df_demo_info.columns = ['city', 'state', 'm_population', 'f_population', 'total_population', 'num_of_veterans', 'foreign_born', 'state_code', 'race']
df_demo_info.head()

,city,state,m_population,f_population,total_population,num_of_veterans,foreign_born,state_code,race
0,Silver Spring,Maryland,40601.0,41862.0,82463,1562.0,30908.0,MD,Hispanic or Latino
1,Quincy,Massachusetts,44129.0,49500.0,93629,4147.0,32935.0,MA,White
2,Hoover,Alabama,38040.0,46799.0,84839,4819.0,8229.0,AL,Asian
3,Rancho Cucamonga,California,88127.0,87105.0,175232,5821.0,33878.0,CA,Black or African-American
4,Newark,New Jersey,138040.0,143873.0,281913,5829.0,86253.0,NJ,White

In [128]:
df_demo_stat = df_demo[['City', 'State', 'Median Age', 'Average Household Size', 'State Code']]
df_demo_stat.columns = ['city', 'state', 'median_age', 'avg_household_size', 'state_code']
df_demo_stat.head()

               city          state  median_age  avg_household_size state_code
0     Silver Spring       Maryland        33.8                2.60         MD
1            Quincy  Massachusetts        41.0                2.39         MA
2            Hoover        Alabama        38.5                2.58         AL
3  Rancho Cucamonga     California        34.5                3.18         CA
4            Newark     New Jersey        34.6                2.73         NJ

### Step 2: Explore and Assess the Data
#### Explore the Data 
Identify data quality issues, like missing values, duplicate data, etc.

#### Cleaning Steps
Document steps necessary to clean the data

#### Converting floats into datetime format for fact_immigration table

In [129]:
fact_immigration.dtypes

cic_id          float64
year            float64
month           float64
dep_city         object
arrival_date    float64
dep_date        float64
travel_code     float64
visa            float64
country          object
dtype: object

In [130]:
fact_immigration['arrival_date'] = pd.to_datetime(fact_immigration['arrival_date'], unit='D',
               origin=pd.Timestamp('1960-01-01'))
fact_immigration['dep_date'] = pd.to_datetime(fact_immigration['dep_date'], unit='D',
               origin=pd.Timestamp('1960-01-01'))
fact_immigration.head()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

,cic_id,year,month,dep_city,arrival_date,dep_date,travel_code,visa,country
0,6.0,2016.0,4.0,XXX,2016-04-29,NaT,NaN,2.0,United States
1,7.0,2016.0,4.0,ATL,2016-04-07,NaT,1.0,3.0,United States
2,15.0,2016.0,4.0,WAS,2016-04-01,2016-08-25,1.0,2.0,United States
3,16.0,2016.0,4.0,NYC,2016-04-01,2016-04-23,1.0,2.0,United States
4,17.0,2016.0,4.0,NYC,2016-04-01,2016-04-23,1.0,2.0,United States

In [131]:
fact_immigration = fact_immigration[pd.notnull(fact_immigration['arrival_date'])]
fact_immigration = fact_immigration[pd.notnull(fact_immigration['dep_date'])]

#### Dropping the non-integer rows in flight_number column in the dim_immigration_air table

In [132]:
dim_immigration_air.dtypes

cic_id           float64
airline           object
admin_number     float64
flight_number     object
visa             float64
visa_type         object
dtype: object

In [133]:
dim_immigration_air.where(dim_immigration_air['flight_number'] == 'LAND')

            cic_id airline  admin_number flight_number  visa visa_type
0              NaN     NaN           NaN           NaN   NaN       NaN
1              NaN     NaN           NaN           NaN   NaN       NaN
2              NaN     NaN           NaN           NaN   NaN       NaN
3              NaN     NaN           NaN           NaN   NaN       NaN
4              NaN     NaN           NaN           NaN   NaN       NaN
5              NaN     NaN           NaN           NaN   NaN       NaN
6              NaN     NaN           NaN           NaN   NaN       NaN
7              NaN     NaN           NaN           NaN   NaN       NaN
8              NaN     NaN           NaN           NaN   NaN       NaN
9              NaN     NaN           NaN           NaN   NaN       NaN
10             NaN     NaN           NaN           NaN   NaN       NaN
11             NaN     NaN           NaN           NaN   NaN       NaN
12             NaN     NaN           NaN           NaN   NaN       NaN
13             NaN     NaN           NaN           NaN   NaN       NaN
14             NaN     NaN           NaN           NaN   NaN       NaN
15             NaN     NaN           NaN           NaN   NaN       NaN
16             NaN     NaN           NaN           NaN   NaN       NaN
17             NaN     NaN           NaN           NaN   NaN       NaN
18             NaN     NaN           NaN           NaN   NaN       NaN
19             NaN     NaN           NaN           NaN   NaN       NaN
20             NaN     NaN           NaN           NaN   NaN       NaN
21             NaN     NaN           NaN           NaN   NaN       NaN
22             NaN     NaN           NaN           NaN   NaN       NaN
23             NaN     NaN           NaN           NaN   NaN       NaN
24             NaN     NaN           NaN           NaN   NaN       NaN
25             NaN     NaN           NaN           NaN   NaN       NaN
26             NaN     NaN           NaN           NaN   NaN       NaN
27             NaN     NaN           NaN           NaN   NaN       NaN
28             NaN     NaN           NaN           NaN   NaN       NaN
29             NaN     NaN           NaN           NaN   NaN       NaN
...            ...     ...           ...           ...   ...       ...
3096283  5200122.0     NaN  9.466694e+10          LAND   2.0        B2
3096284  5200121.0     NaN  9.466708e+10          LAND   2.0        B2
3096285        NaN     NaN           NaN           NaN   NaN       NaN
3096286        NaN     NaN           NaN           NaN   NaN       NaN
3096287  2303672.0     NaN  7.870831e+08          LAND   1.0        B1
3096288   625288.0     NaN  9.266689e+10          LAND   1.0        B1
3096289  2873230.0     NaN  8.806588e+10          LAND   2.0        B2
3096290  2873231.0     NaN  8.806625e+10          LAND   2.0        B2
3096291  2873232.0     NaN  8.806640e+10          LAND   2.0        B2
3096292        NaN     NaN           NaN           NaN   NaN       NaN
3096293        NaN     NaN           NaN           NaN   NaN       NaN
3096294   218224.0     NaN  9.251075e+10          LAND   2.0        B2
3096295  2873233.0     NaN  9.356363e+10          LAND   2.0        B2
3096296  2873234.0     NaN  9.356366e+10          LAND   2.0        B2
3096297  3298796.0     NaN  9.379549e+10          LAND   1.0        B1
3096298  4249463.0     NaN  9.428408e+10          LAND   1.0        B1
3096299  1153287.0     NaN  6.878366e+08          LAND   2.0        B2
3096300  1153288.0     NaN  6.880218e+08          LAND   2.0        B2
3096301        NaN     NaN           NaN           NaN   NaN       NaN
3096302  4471818.0     NaN  9.429612e+10          LAND   2.0        B2
3096303  4471817.0     NaN  9.429629e+10          LAND   2.0        B2
3096304  4471819.0     NaN  9.429643e+10          LAND   2.0        B2
3096305        NaN     NaN           NaN           NaN   NaN       NaN
3096306  4249464.0     NaN  9.426909e+10          LAND   1.0        B1
3096307  5416391.0     NaN  9.471480e+10          LAND   1.0        B1
3096308        NaN     NaN           NaN           NaN   NaN       NaN
3096309        NaN     NaN           NaN           NaN   NaN       NaN
3096310        NaN     NaN           NaN           NaN   NaN       NaN
3096311  5658953.0     NaN  9.488710e+10          LAND   2.0        B2
3096312        NaN     NaN           NaN           NaN   NaN       NaN

[3096313 rows x 6 columns]

In [134]:
dim_immigration_air.iloc[540]

cic_id                   610
airline                  *GA
admin_number     9.24611e+10
flight_number          VPCSW
visa                       2
visa_type                 B2
Name: 540, dtype: object

In [135]:
dim_immigration_air['flight_number'] = dim_immigration_air[dim_immigration_air['flight_number'].apply(lambda x: str(x).isdigit())]

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [136]:
dim_immigration_air['flight_number'] = pd.to_numeric(dim_immigration_air['flight_number'])

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [137]:
dim_immigration_air.dtypes

cic_id           float64
airline           object
admin_number     float64
flight_number    float64
visa             float64
visa_type         object
dtype: object

#### Extracting necessary information from i94 file

In [138]:
with open("I94_SAS_Labels_Descriptions.SAS") as f:
    contents = f.readlines()

In [139]:
countries = contents[9:298]
ports = contents[302:962]
modes = contents[972:976]
states = contents[981:1036]
visa = contents[1046:1049]

In [140]:
country = [x.strip().split('=') for x in countries]
country_code = [x[0].replace("'","") for x in country]
country_name = [x[1].replace("'","") for x in country]
df_country = pd.DataFrame({'country_code':country_code, 'country_name':country_name})
df_country.head()

  country_code                                       country_name
0         582     MEXICO Air Sea, and Not Reported (I-94, no l...
1         236                                         AFGHANISTAN
2         101                                             ALBANIA
3         316                                             ALGERIA
4         102                                             ANDORRA

In [141]:
port = [x.strip().split('=') for x in ports]
port_code = [x[0].replace("'","").strip('\t') for x in port]
port_loc = [x[1].replace("'","").strip('\t') for x in port]
port_loc_c = [x.split(',')[0] for x in port_loc]
port_loc_s = [x.split(',')[-1] for x in port_loc]
df_port = pd.DataFrame({'port_code':port_code, 'port_loc_city':port_loc_c, 'port_loc_state':port_loc_s})
df_port.head()

  port_code             port_loc_city    port_loc_state
0       ALC                     ALCAN   AK
1       ANC                 ANCHORAGE       AK
2       BAR  BAKER AAF - BAKER ISLAND                AK
3       DAC             DALTONS CACHE           AK
4       PIZ    DEW STATION PT LAY DEW                AK

In [142]:
mode = [x.strip().split('=') for x in modes]
code = [x[0] for x in mode]
mode_name = [x[1].replace("'", "").strip(";") for x in mode]
df_mode = pd.DataFrame({'code':code, 'mode':mode_name})
df_mode.head()

  code            mode
0   1              Air
1   2              Sea
2   3             Land
3   9    Not reported

In [143]:
state = [x.strip().split('=') for x in states]
code = [x[0].replace("'", "") for x in state]
state_name = [x[1].replace("'", "") for x in state]
df_state = pd.DataFrame({'state_code':code, 'state':state_name})
df_state.head()

  state_code       state
0         AL     ALABAMA
1         AK      ALASKA
2         AZ     ARIZONA
3         AR    ARKANSAS
4         CA  CALIFORNIA

In [144]:
visa_list = [x.strip().split('=') for x in visa]
code = [x[0] for x in visa_list]
visa_name = [x[1] for x in visa_list]
df_visa = pd.DataFrame({'code':code, 'visa':visa_name})
df_visa.head()

  code       visa
0   1    Business
1   2    Pleasure
2   3     Student

#### Dropping missing values and duplicate data

In [161]:
# immigration data
fact_immigration.dropna(subset=['cic_id'])
dim_immigration_personal.dropna(subset=['cic_id'])
dim_immigration_air.dropna(subset=['cic_id'])

fact_immigration.drop_duplicates(subset = 'cic_id', keep = 'first')
dim_immigration_personal.drop_duplicates(subset = 'cic_id', keep = 'first')
dim_immigration_air.drop_duplicates(subset = 'cic_id', keep = 'first')

# temperature data
df_temp_us.dropna()
df_temp_us.drop_duplicates(subset = 'dt', keep = 'first')

# demography data
df_demo_info.dropna()
df_demo_stat.dropna()
df_demo_info.drop_duplicates(subset = 'city', keep = 'first')
df_demo_stat.drop_duplicates(subset = 'city', keep = 'first')

,city,state,median_age,avg_household_size,state_code
0,Silver Spring,Maryland,33.8,2.60,MD
1,Quincy,Massachusetts,41.0,2.39,MA
2,Hoover,Alabama,38.5,2.58,AL
3,Rancho Cucamonga,California,34.5,3.18,CA
4,Newark,New Jersey,34.6,2.73,NJ
5,Peoria,Illinois,33.1,2.40,IL
6,Avondale,Arizona,29.1,3.18,AZ
7,West Covina,California,39.8,3.56,CA
8,O'Fallon,Missouri,36.0,2.77,MO
9,High Point,North Carolina,35.5,2.65,NC
10,Folsom,California,40.9,2.62,CA
12,Philadelphia,Pennsylvania,34.1,2.61,PA
13,Wichita,Kansas,34.6,2.56,KS
15,Fort Myers,Florida,37.3,2.45,FL
16,Pittsburgh,Pennsylvania,32.9,2.13,PA
17,Laredo,Texas,28.8,3.66,TX
18,Berkeley,California,32.5,2.35,CA
19,Santa Clara,California,35.2,2.75,CA
20,Allen,Pennsylvania,33.5,2.67,PA
21,Hampton,Virginia,35.5,2.48,VA
22,Bolingbrook,Illinois,33.7,3.42,IL
23,Frederick,Maryland,36.1,2.48,MD
24,Sparks,Nevada,36.1,2.63,NV
25,Rancho Cordova,California,33.8,2.86,CA
26,Westminster,Colorado,37.8,2.63,CO
27,Lakewood,Colorado,37.7,2.29,CO
28,Flint,Michigan,35.3,2.38,MI
29,New Haven,Connecticut,29.9,2.48,CT
30,Brooklyn Park,Minnesota,35.1,2.85,MN
31,Chula Vista,California,34.6,3.32,CA
...,...,...,...,...,...
1420,Miami,Florida,40.4,2.50,FL
1425,Apple Valley,California,34.3,3.03,CA
1435,Macon,Georgia,36.0,2.46,GA
1443,Cleveland,Ohio,36.0,2.24,OH
1453,Tempe,Arizona,28.8,2.44,AZ
1470,Albany,New York,32.8,2.08,NY
1479,Southfield,Michigan,41.6,2.27,MI
1495,Durham,North Carolina,33.2,2.40,NC
1501,Pharr,Texas,26.9,3.67,TX
1504,Spokane Valley,Washington,36.0,2.39,WA
1511,Grand Rapids,Michigan,32.1,2.56,MI
1530,Sunnyvale,California,35.7,2.74,CA
1543,Columbia,South Carolina,28.0,2.32,SC
1562,Fort Lauderdale,Florida,42.8,2.38,FL
1606,Warwick,Rhode Island,42.6,2.40,RI
1621,Aurora,Colorado,34.2,2.82,CO
1629,Bloomington,Minnesota,40.9,2.30,MN
1639,Canton,Ohio,33.4,2.32,OH
1735,Lansing,Michigan,31.4,2.39,MI
1748,Mayagüez,Puerto Rico,38.1,NaN,PR
1815,Laguna Niguel,California,45.8,2.58,CA
1816,Pine Hills,Florida,29.2,3.30,FL
1826,New York,New York,36.0,2.68,NY
1995,Ponce,Puerto Rico,40.5,NaN,PR
2004,Bayamón,Puerto Rico,39.4,NaN,PR
2063,Mobile,Alabama,38.0,2.40,AL
2066,League City,Texas,35.9,2.72,TX
2573,Lafayette,Indiana,33.5,2.19,IN
2589,Guaynabo,Puerto Rico,42.2,NaN,PR
2726,Missoula,Montana,34.7,2.15,MT

### Step 3: Define the Data Model
#### 3.1 Conceptual Data Model
<img width="802" alt="Screen Shot 2021-09-09 at 10 46 07 PM" src="https://user-images.githubusercontent.com/79597984/132707777-a124e5d3-03d0-45c6-9bd5-61a8fc6f5618.png">

#### 3.2 Mapping Out Data Pipelines
List the steps necessary to pipeline the data into the chosen data model
1. Create the data model by coping the drop and create statements from `create_tables.sql` file into the query editor in redshift.
2. Run step 1 & 2 above to clean the data.
3. Insert the data into the tables created by running the below code in step `4.1`.

### Step 4: Run Pipelines to Model the Data 
#### 4.1 Create the data model
Build the data pipelines to create the data model.

In [34]:
# Write code here
conn = psycopg2.connect("host=redshift-cluster-1.*****.us-west-2.redshift.amazonaws.com dbname=dev user=awsuser password=***** port=5439")
cur = conn.cursor()
conn.autocommit = True

In [147]:
for index, row in fact_immigration.head(2000).iterrows():
    cur.execute(insert_fact, list(row.values))

In [148]:
for index, row in dim_immigration_personal.head(2000).iterrows():
    cur.execute(insert_dim_imm_per, list(row.values))

In [149]:
for index, row in dim_immigration_air.head(2000).iterrows():
    cur.execute(insert_dim_imm_air, list(row.values))

In [150]:
for index, row in df_demo_info.iterrows():
    cur.execute(insert_dim_demo_info, list(row.values))

In [151]:
for index, row in df_demo_stat.iterrows():
    cur.execute(insert_dim_demo_stat, list(row.values))

In [152]:
for index, row in df_temp_us.head(2000).iterrows():
    cur.execute(insert_dim_temp, list(row.values))

#### 4.2 Data Quality Checks
Explain the data quality checks you'll perform to ensure the pipeline ran as expected. These could include:
 * Integrity constraints on the relational database (e.g., unique key, data type, etc.)
 * Unit tests for the scripts to ensure they are doing the right thing
 * Source/Count checks to ensure completeness
 
Run Quality Checks

#### Checking if the duplicated rows are all removed

In [153]:
duplicate_query = """
    SELECT cic_id, COUNT(cic_id)
    FROM fact_immigration
    GROUP BY cic_id
    HAVING COUNT(cic_id)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()
print(data)

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in cic_id in the table fact_immigration")

[]
There's no duplicated rows

In [154]:
duplicate_query = """
    SELECT cic_id, COUNT(cic_id)
    FROM dim_immigration_personal
    GROUP BY cic_id
    HAVING COUNT(cic_id)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()
print(data)

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in cic_id in the table dim_immigration_personal")

[]
There's no duplicated rows

In [155]:
duplicate_query = """
    SELECT cic_id, COUNT(cic_id)
    FROM dim_immigration_air
    GROUP BY cic_id
    HAVING COUNT(cic_id)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()
print(data)

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in cic_id in the table dim_immigration_air")

[]
There's no duplicated rows

In [162]:
duplicate_query = """
    SELECT city, COUNT(city)
    FROM dim_demo_info
    GROUP BY city
    HAVING COUNT(city)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()
print(data)

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in city in the table dim_demo_info")

[('Silver Spring', 5), ('Quincy', 5), ('Hoover', 4), ('Rancho Cucamonga', 5), ('Newark', 5), ('Peoria', 10), ('Avondale', 5), ('West Covina', 5), ("O'Fallon", 5), ('High Point', 5), ('Folsom', 5), ('Philadelphia', 5), ('Wichita', 5), ('Fort Myers', 4), ('Pittsburgh', 5), ('Laredo', 5), ('Berkeley', 5), ('Santa Clara', 5), ('Allen', 10), ('Hampton', 5), ('Bolingbrook', 5), ('Frederick', 5), ('Sparks', 5), ('Rancho Cordova', 5), ('Westminster', 10), ('Lakewood', 10), ('Flint', 5), ('New Haven', 5), ('Brooklyn Park', 5), ('Chula Vista', 5), ('Danbury', 5), ('Framingham', 5), ('Saint Petersburg', 5), ('Miami Gardens', 3), ('Salt Lake City', 5), ('Suffolk', 5), ('North Little Rock', 4), ('Jurupa Valley', 5), ('Los Angeles', 5), ('Flower Mound', 5), ('Vacaville', 5), ('Clarksville', 5), ('New Britain', 4), ('Tulsa', 5), ('Seattle', 5), ('Mesa', 5), ('Yonkers', 5), ('Camden', 4), ('Alexandria', 5), ('Jonesboro', 5), ('El Monte', 5), ('Roswell', 5), ('Omaha', 5), ('Troy', 5), ('Winston-Salem', 5), ('Corpus Christi', 5), ('Atlanta', 5), ('Bryan', 5), ('Lynchburg', 5), ('Columbia', 15), ('Killeen', 5), ('Nashville', 5), ('Somerville', 5), ('Bakersfield', 5), ('Montgomery', 5), ('Huntsville', 5), ('Greensboro', 5), ('Turlock', 5), ('Lynwood', 4), ('El Paso', 5), ('Lexington-Fayette  county', 5), ('Rock Hill', 5), ('Richardson', 5), ('Waco', 5), ('San Buenaventura', 5), ('Stamford', 5), ('Vallejo', 5), ('Denver', 5), ('Springdale', 5), ('Chino', 5), ('Toms River', 5), ('Lynn', 5), ('Lawton', 5), ('Garland', 5), ('Layton', 5), ('Bloomington', 15), ('Newton', 5), ('Clearwater', 5), ('Kenner', 5), ('Las Cruces', 5), ('Yakima', 5), ('Des Moines', 5), ('Wichita Falls', 5), ('Wilmington', 10), ('Cranston', 5), ('Amarillo', 5), ('Buffalo', 5), ('Livonia', 5), ('San Leandro', 5), ('Fresno', 5), ('Saint George', 5), ('San Juan', 3), ('Redlands', 5), ('Thousand Oaks', 5), ('Rio Rancho', 5), ('Provo', 5), ('Tallahassee', 5), ('Aurora', 10), ('Minneapolis', 5), ('Anaheim', 5), ('San Marcos', 5), ('Norwalk', 10), ('Fort Worth', 5), ('Cambridge', 5), ('Deerfield Beach', 5), ('Beaumont', 5), ('Spring Valley', 5), ('Sioux City', 5), ('Alafaya', 4), ('Washington', 5), ('Grand Prairie', 5), ('Waukesha', 5), ('Miami Beach', 4), ('North Las Vegas', 5), ('Fort Smith', 5), ('Salinas', 5), ('Springfield', 15), ('Bellingham', 5), ('Green Bay', 5), ('Maple Grove', 5), ('Escondido', 5), ('Rockford', 5), ('Memphis', 5), ('Caguas', 2), ('Metairie', 5), ('Tracy', 5), ('Champaign', 4), ('West Palm Beach', 5), ('Beaverton', 5), ('Ogden', 5), ('Decatur', 5), ('Pompano Beach', 5), ('Nashua', 5), ('Vancouver', 5), ('Fargo', 5), ('El Cajon', 5), ('Lancaster', 5), ('Miramar', 4), ('Riverview', 5), ('Arlington Heights', 4), ('Lorain', 5), ('Mesquite', 5), ('Appleton', 5), ('Johns Creek', 5), ('Nampa', 5), ('Sterling Heights', 4), ('Tacoma', 5), ('Manchester', 5), ('Overland Park', 5), ('Cicero', 5), ('Weston', 5), ('Meridian', 5), ('Trenton', 5), ('Temecula', 5), ('Saint Charles', 5), ('Antioch', 5), ('Eugene', 5), ('Edinburg', 3), ('Huntington Beach', 5), ('Torrance', 5), ('South Bend', 5), ('Bethlehem', 4), ('Birmingham', 5), ('Hawthorne', 5), ('Boca Raton', 5), ('Vista', 4), ('Brockton', 5), ('New Rochelle', 5), ('Dearborn', 5), ('Charleston', 5), ('Elizabeth', 5), ('Syracuse', 5), ('Redding', 5), ('Scottsdale', 5), ('Glendale', 10), ('Fishers', 4), ('Waldorf', 5), ('Las Vegas', 5), ('Victoria', 4), ('Anchorage', 5), ('San Diego', 5), ('Dayton', 5), ('Auburn', 5), ('Charlotte', 5), ('Gulfport', 4), ('Abilene', 5), ('Centreville', 5), ('Pleasanton', 5), ('Waterbury', 5), ('Davie', 5), ('Houston', 5), ('Concord', 10), ('Eagan', 5), ('Duluth', 5), ('Carolina', 2), ('Ellicott City', 5), ('Port Saint Lucie', 5), ('Greeley', 5), ('Ames', 4), ('West Jordan', 5), ('Chico', 5), ('Chino Hills', 5), ('New Bedford', 5), ('San Bernardino', 5), ('Longmont', 5), ('Lincoln', 5), ('Pasco', 5), ('Cincinnati', 5), ('New Braunfels', 5), ('Union City', 10), ('Fontana', 5), ('Milwaukee', 5), ('Racine', 5), ('Santa Maria', 5), ('Marysville', 5), ('Inglewood', 5), ('Cedar Rapids', 5), ('German', 5), ('Highlands Ranch', 5), ('Tustin', 5), ('Kent', 5), ('Urban Honolulu', 5), ('Richmond', 10), ('Deltona', 5), ('Kissimmee', 4), ('San Mateo', 5), ('Fall River', 5), ('Carmichael', 5), ('Lauderhill', 5), ('Worcester', 5), ('Providence', 5), ('Fayetteville', 10), ('Santa Rosa', 5), ('Lakeland', 5), ('Boulder', 5), ('Bayonne', 4), ('Santa Barbara', 5), ('Yuba City', 5), ('Palo Alto', 5), ('Pueblo', 5), ('The Villages', 3), ('Fort Wayne', 5), ('Santa Ana', 5), ('Bismarck', 5), ('Phoenix', 5), ('Daly City', 5), ('South San Francisco', 5), ('Independence', 5), ('Kennewick', 5), ('Flagstaff', 5), ('Brandon', 5), ('Kansas City', 10), ('Waukegan', 5), ('Fort Collins', 5), ('Jacksonville', 10), ('Cary', 5), ('Saint Joseph', 5), ('Melbourne', 5), ('Palm Bay', 5), ('Plantation', 4), ('Olathe', 5), ('Sioux Falls', 5), ('Portsmouth', 5), ('Jackson', 10), ('Spokane', 5), ('Colorado Springs', 5), ('McKinney', 5), ('Henderson', 5), ('Norfolk', 5), ('Arvada', 5), ('Hollywood', 5), ('Chesapeake', 5), ('Columbus', 10), ('Spring Hill', 5), ('Kenosha', 5), ('Kendall', 4), ('Redondo Beach', 5), ('Walnut Creek', 4), ('Mission', 3), ('McAllen', 5), ('Cheektowaga', 4), ('Oceanside', 5), ('Orlando', 5), ('Parma', 5), ('Harlingen', 3), ('Pembroke Pines', 5), ('Alhambra', 5), ('Brentwood', 5), ('Riverside', 5), ('Menifee', 5), ('Kalamazoo', 5), ('Carson', 5), ('Ann Arbor', 5), ('Farmington Hills', 5), ('Missouri City', 4), ('Orange', 5), ('Everett', 5), ('Citrus Heights', 5), ('Gainesville', 5), ('Milpitas', 5), ('Tampa', 5), ('Santa Monica', 5), ('Eau Claire', 5), ('Enterprise', 5), ('Shawnee', 5), ('North Charleston', 5), ('Boynton Beach', 4), ('Temple', 5), ('Rockville', 5), ('Cape Coral', 5), ('Manteca', 5), ('Little Rock', 5), ('Oxnard', 5), ('Bk', 5), ('Evanston', 5), ('Atascocita', 5), ('Surprise', 5), ('Dothan', 5), ('Rapid City', 5), ("Lee's Summit", 5), ('Warren', 5), ('Erie', 5), ('Mountain View', 5), ('West Valley City', 5), ('Hartford', 5), ('Fremont', 5), ('Elgin', 5), ('Greenville', 5), ('Gastonia', 5), ('Frisco', 5), ('Oklahoma City', 5), ('Carlsbad', 5), ('Pasadena', 10), ('Naperville', 5), ('Johnson City', 5), ('Goodyear', 5), ('Wyoming', 5), ('Reading', 5), ('Rochester Hills', 5), ('Madison', 5), ('Portland', 10), ('College Station', 5), ('Lewisville', 5), ('Raleigh', 5), ('Mount Vernon', 5), ('Dallas', 5), ('San Tan Valley', 5), ('East Orange', 5), ('Austin', 5), ('Casas Adobes', 5), ('Indianapolis', 5), ('Renton', 5), ('Odessa', 5), ('Round Rock', 5), ('Santa Fe', 5), ('Akron', 5), ('San Jose', 5), ('Saint Paul', 5), ('Muncie', 4), ('Victorville', 5), ('Murfreesboro', 5), ('Chattanooga', 5), ('Fairfield', 5), ('Toledo', 5), ('Asheville', 5), ('Savannah', 5), ('Louisville/Jefferson County metro government', 5), ('Yorba Linda', 5), ('Billings', 5), ('Denton', 5), ('Long Beach', 5), ('Tuscaloosa', 5), ('Elk Grove', 5), ('Paradise', 5), ('Sandy Springs', 5), ('Pearland', 5), ('Virginia Beach', 5), ('Roseville', 5), ('Homestead', 3), ('Iowa City', 5), ('Arden-Arcade', 5), ('Largo', 5), ('Carrollton', 5), ('Chandler', 5), ('Irvine', 5), ('Medford', 5), ('Coral Springs', 5), ('Bossier City', 5), ('Woodbury', 4), ('Boston', 5), ('Pittsburg', 5), ('San Ramon', 5), ('Reno', 5), ('Topeka', 5), ('Newport News', 5), ('Poinciana', 5), ('Compton', 5), ('Cedar Park', 5), ('Merced', 5), ('Shreveport', 5), ('Palatine', 4), ('San Angelo', 5), ('Passaic', 4), ('Lake Charles', 5), ('North Richland Hills', 5), ('Boise', 5), ('Carmel', 4), ('Palmdale', 5), ('Baltimore', 5), ('Indio', 5), ('Florence-Graham', 3), ('Santa Clarita', 5), ('Buena Park', 5), ('San Clemente', 4), ('Lawrence', 9), ('Downey', 5), ('Lafayette', 9), ('Newport Beach', 4), ('Schenectady', 5), ('South Gate', 5), ('Brownsville', 5), ('Costa Mesa', 5), ('Tyler', 5), ('Napa', 5), ('Centennial', 5), ('Sunrise', 4), ('Tucson', 5), ('Fullerton', 5), ('Lake Forest', 5), ('Stockton', 5), ('San Antonio', 5), ('Orem', 5), ('Norman', 5), ('Youngs', 5), ('Hayward', 5), ('Sandy', 5), ('Moreno Valley', 5), ('Delray Beach', 4), ('Gresham', 5), ('Federal Way', 5), ('Waterloo', 5), ('Jersey City', 5), ('Mission Viejo', 5), ('Dale City', 5), ('Albuquerque', 5), ('Plano', 5), ('Hesperia', 5), ('Lehigh Acres', 5), ('Pawtucket', 5), ("Town 'n' Country", 5), ('Saint Cloud', 5), ('Midland', 5), ('Chicago', 5), ('Knoxville', 5), ('Westland', 5), ('Yuma', 5), ('Roanoke', 5), ('Rialto', 5), ('Pomona', 5), ('Warner Robins', 5), ('East Los Angeles', 5), ('Simi Valley', 5), ('Davenport', 5), ('Thornton', 5), ('Gary', 5), ('Palm Coast', 5), ('Hialeah', 4), ('Clifton', 5), ('Bellflower', 5), ('Broomfield', 5), ('Joliet', 5), ('San Francisco', 5), ('Camarillo', 5), ('Skokie', 4), ('Redwood City', 5), ('Evansville', 5), ('Hillsboro', 5), ('The Woodlands', 5), ('Longview', 5), ('Upland', 5), ('Sunrise Manor', 5), ('Lubbock', 5), ('Kirkland', 5), ('Garden Grove', 5), ('Baton Rouge', 5), ('Livermore', 5), ('Paterson', 5), ('Conroe', 5), ('Edmond', 5), ('Sacramento', 5), ('Detroit', 5), ('Ontario', 5), ('Alameda', 5), ('Clovis', 5), ('Gilbert', 5), ('Hammond', 5), ('Saint Louis', 5), ('Athens-Clarke County unified government', 5), ('Scranton', 4), ('Modesto', 5), ('Perris', 4), ('South Jordan', 3), ('Visalia', 5), ('Davis', 5), ('Gaithersburg', 5), ('Albany', 10), ('Plymouth', 5), ('Corona', 5), ('Rochester', 10), ('Oshkosh', 5), ('Baldwin Park', 5), ('Oakland', 5), ('Augusta-Richmond County consolidated government', 5), ('Salem', 5), ('Schaumburg', 5), ('Lowell', 5), ('Glen Burnie', 5), ('Bend', 5), ('Bridgeport', 5), ('Broken Arrow', 5), ('New Orleans', 5), ('Arlington', 10), ('Bellevue', 5), ('Irving', 5), ('Whittier', 5), ('Bay', 5), ('Loveland', 5), ('Mount Pleasant', 4), ('Hemet', 5), ('Franklin', 4), ('Sugar Land', 4), ('Murrieta', 5), ('Miami', 5), ('Apple Valley', 5), ('Macon', 5), ('Cleveland', 5), ('Tempe', 5), ('Southfield', 5), ('Durham', 5), ('Pharr', 3), ('Spokane Valley', 5), ('Grand Rapids', 5), ('Sunnyvale', 5), ('Fort Lauderdale', 5), ('Warwick', 4), ('Canton', 4), ('Lansing', 5), ('Mayagüez', 2), ('Laguna Niguel', 4), ('Pine Hills', 4), ('New York', 5), ('Mobile', 5), ('League City', 4), ('Guaynabo', 2), ('Missoula', 5)]
There's 565 duplicated rows in city in the table dim_demo_info

In [163]:
duplicate_query = """
    SELECT city, COUNT(city)
    FROM dim_demo_stat
    GROUP BY city
    HAVING COUNT(city)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()
print(data)

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in city in the table dim_demo_stat")

[('Silver Spring', 5), ('Quincy', 5), ('Hoover', 4), ('Rancho Cucamonga', 5), ('Newark', 5), ('Peoria', 10), ('Avondale', 5), ('West Covina', 5), ("O'Fallon", 5), ('High Point', 5), ('Folsom', 5), ('Philadelphia', 5), ('Wichita', 5), ('Fort Myers', 4), ('Pittsburgh', 5), ('Laredo', 5), ('Berkeley', 5), ('Santa Clara', 5), ('Allen', 10), ('Hampton', 5), ('Bolingbrook', 5), ('Frederick', 5), ('Sparks', 5), ('Rancho Cordova', 5), ('Westminster', 10), ('Lakewood', 10), ('Flint', 5), ('New Haven', 5), ('Brooklyn Park', 5), ('Chula Vista', 5), ('Danbury', 5), ('Framingham', 5), ('Saint Petersburg', 5), ('Miami Gardens', 3), ('Salt Lake City', 5), ('Suffolk', 5), ('North Little Rock', 4), ('Jurupa Valley', 5), ('Los Angeles', 5), ('Flower Mound', 5), ('Vacaville', 5), ('Clarksville', 5), ('New Britain', 4), ('Tulsa', 5), ('Seattle', 5), ('Mesa', 5), ('Yonkers', 5), ('Camden', 4), ('Alexandria', 5), ('Jonesboro', 5), ('El Monte', 5), ('Roswell', 5), ('Omaha', 5), ('Troy', 5), ('Winston-Salem', 5), ('Corpus Christi', 5), ('Atlanta', 5), ('Bryan', 5), ('Lynchburg', 5), ('Columbia', 15), ('Killeen', 5), ('Nashville', 5), ('Somerville', 5), ('Bakersfield', 5), ('Montgomery', 5), ('Huntsville', 5), ('Greensboro', 5), ('Turlock', 5), ('Lynwood', 4), ('El Paso', 5), ('Lexington-Fayette  county', 5), ('Rock Hill', 5), ('Richardson', 5), ('Waco', 5), ('San Buenaventura', 5), ('Stamford', 5), ('Vallejo', 5), ('Denver', 5), ('Springdale', 5), ('Chino', 5), ('Toms River', 5), ('Lynn', 5), ('Lawton', 5), ('Garland', 5), ('Layton', 5), ('Bloomington', 15), ('Newton', 5), ('Clearwater', 5), ('Kenner', 5), ('Las Cruces', 5), ('Yakima', 5), ('Des Moines', 5), ('Wichita Falls', 5), ('Wilmington', 10), ('Cranston', 5), ('Amarillo', 5), ('Buffalo', 5), ('Livonia', 5), ('San Leandro', 5), ('Fresno', 5), ('Saint George', 5), ('San Juan', 3), ('Redlands', 5), ('Thousand Oaks', 5), ('Rio Rancho', 5), ('Provo', 5), ('Tallahassee', 5), ('Aurora', 10), ('Minneapolis', 5), ('Anaheim', 5), ('San Marcos', 5), ('Norwalk', 10), ('Fort Worth', 5), ('Cambridge', 5), ('Deerfield Beach', 5), ('Beaumont', 5), ('Spring Valley', 5), ('Sioux City', 5), ('Alafaya', 4), ('Washington', 5), ('Grand Prairie', 5), ('Waukesha', 5), ('Miami Beach', 4), ('North Las Vegas', 5), ('Fort Smith', 5), ('Salinas', 5), ('Springfield', 15), ('Bellingham', 5), ('Green Bay', 5), ('Maple Grove', 5), ('Escondido', 5), ('Rockford', 5), ('Memphis', 5), ('Caguas', 2), ('Metairie', 5), ('Tracy', 5), ('Champaign', 4), ('West Palm Beach', 5), ('Beaverton', 5), ('Ogden', 5), ('Decatur', 5), ('Pompano Beach', 5), ('Nashua', 5), ('Vancouver', 5), ('Fargo', 5), ('El Cajon', 5), ('Lancaster', 5), ('Miramar', 4), ('Riverview', 5), ('Arlington Heights', 4), ('Lorain', 5), ('Mesquite', 5), ('Appleton', 5), ('Johns Creek', 5), ('Nampa', 5), ('Sterling Heights', 4), ('Tacoma', 5), ('Manchester', 5), ('Overland Park', 5), ('Cicero', 5), ('Weston', 5), ('Meridian', 5), ('Trenton', 5), ('Temecula', 5), ('Saint Charles', 5), ('Antioch', 5), ('Eugene', 5), ('Edinburg', 3), ('Huntington Beach', 5), ('Torrance', 5), ('South Bend', 5), ('Bethlehem', 4), ('Birmingham', 5), ('Hawthorne', 5), ('Boca Raton', 5), ('Vista', 4), ('Brockton', 5), ('New Rochelle', 5), ('Dearborn', 5), ('Charleston', 5), ('Elizabeth', 5), ('Syracuse', 5), ('Redding', 5), ('Scottsdale', 5), ('Glendale', 10), ('Fishers', 4), ('Waldorf', 5), ('Las Vegas', 5), ('Victoria', 4), ('Anchorage', 5), ('San Diego', 5), ('Dayton', 5), ('Auburn', 5), ('Charlotte', 5), ('Gulfport', 4), ('Abilene', 5), ('Centreville', 5), ('Pleasanton', 5), ('Waterbury', 5), ('Davie', 5), ('Houston', 5), ('Concord', 10), ('Eagan', 5), ('Duluth', 5), ('Carolina', 2), ('Ellicott City', 5), ('Port Saint Lucie', 5), ('Greeley', 5), ('Ames', 4), ('West Jordan', 5), ('Chico', 5), ('Chino Hills', 5), ('New Bedford', 5), ('San Bernardino', 5), ('Longmont', 5), ('Lincoln', 5), ('Pasco', 5), ('Cincinnati', 5), ('New Braunfels', 5), ('Union City', 10), ('Fontana', 5), ('Milwaukee', 5), ('Racine', 5), ('Santa Maria', 5), ('Marysville', 5), ('Inglewood', 5), ('Cedar Rapids', 5), ('German', 5), ('Highlands Ranch', 5), ('Tustin', 5), ('Kent', 5), ('Urban Honolulu', 5), ('Richmond', 10), ('Deltona', 5), ('Kissimmee', 4), ('San Mateo', 5), ('Fall River', 5), ('Carmichael', 5), ('Lauderhill', 5), ('Worcester', 5), ('Providence', 5), ('Fayetteville', 10), ('Santa Rosa', 5), ('Lakeland', 5), ('Boulder', 5), ('Bayonne', 4), ('Santa Barbara', 5), ('Yuba City', 5), ('Palo Alto', 5), ('Pueblo', 5), ('The Villages', 3), ('Fort Wayne', 5), ('Santa Ana', 5), ('Bismarck', 5), ('Phoenix', 5), ('Daly City', 5), ('South San Francisco', 5), ('Independence', 5), ('Kennewick', 5), ('Flagstaff', 5), ('Brandon', 5), ('Kansas City', 10), ('Waukegan', 5), ('Fort Collins', 5), ('Jacksonville', 10), ('Cary', 5), ('Saint Joseph', 5), ('Melbourne', 5), ('Palm Bay', 5), ('Plantation', 4), ('Olathe', 5), ('Sioux Falls', 5), ('Portsmouth', 5), ('Jackson', 10), ('Spokane', 5), ('Colorado Springs', 5), ('McKinney', 5), ('Henderson', 5), ('Norfolk', 5), ('Arvada', 5), ('Hollywood', 5), ('Chesapeake', 5), ('Columbus', 10), ('Spring Hill', 5), ('Kenosha', 5), ('Kendall', 4), ('Redondo Beach', 5), ('Walnut Creek', 4), ('Mission', 3), ('McAllen', 5), ('Cheektowaga', 4), ('Oceanside', 5), ('Orlando', 5), ('Parma', 5), ('Harlingen', 3), ('Pembroke Pines', 5), ('Alhambra', 5), ('Brentwood', 5), ('Riverside', 5), ('Menifee', 5), ('Kalamazoo', 5), ('Carson', 5), ('Ann Arbor', 5), ('Farmington Hills', 5), ('Missouri City', 4), ('Orange', 5), ('Everett', 5), ('Citrus Heights', 5), ('Gainesville', 5), ('Milpitas', 5), ('Tampa', 5), ('Santa Monica', 5), ('Eau Claire', 5), ('Enterprise', 5), ('Shawnee', 5), ('North Charleston', 5), ('Boynton Beach', 4), ('Temple', 5), ('Rockville', 5), ('Cape Coral', 5), ('Manteca', 5), ('Little Rock', 5), ('Oxnard', 5), ('Bk', 5), ('Evanston', 5), ('Atascocita', 5), ('Surprise', 5), ('Dothan', 5), ('Rapid City', 5), ("Lee's Summit", 5), ('Warren', 5), ('Erie', 5), ('Mountain View', 5), ('West Valley City', 5), ('Hartford', 5), ('Fremont', 5), ('Elgin', 5), ('Greenville', 5), ('Gastonia', 5), ('Frisco', 5), ('Oklahoma City', 5), ('Carlsbad', 5), ('Pasadena', 10), ('Naperville', 5), ('Johnson City', 5), ('Goodyear', 5), ('Wyoming', 5), ('Reading', 5), ('Rochester Hills', 5), ('Madison', 5), ('Portland', 10), ('College Station', 5), ('Lewisville', 5), ('Raleigh', 5), ('Mount Vernon', 5), ('Dallas', 5), ('San Tan Valley', 5), ('East Orange', 5), ('Austin', 5), ('Casas Adobes', 5), ('Indianapolis', 5), ('Renton', 5), ('Odessa', 5), ('Round Rock', 5), ('Santa Fe', 5), ('Akron', 5), ('San Jose', 5), ('Saint Paul', 5), ('Muncie', 4), ('Victorville', 5), ('Murfreesboro', 5), ('Chattanooga', 5), ('Fairfield', 5), ('Toledo', 5), ('Asheville', 5), ('Savannah', 5), ('Louisville/Jefferson County metro government', 5), ('Yorba Linda', 5), ('Billings', 5), ('Denton', 5), ('Long Beach', 5), ('Tuscaloosa', 5), ('Elk Grove', 5), ('Paradise', 5), ('Sandy Springs', 5), ('Pearland', 5), ('Virginia Beach', 5), ('Roseville', 5), ('Homestead', 3), ('Iowa City', 5), ('Arden-Arcade', 5), ('Largo', 5), ('Carrollton', 5), ('Chandler', 5), ('Irvine', 5), ('Medford', 5), ('Coral Springs', 5), ('Bossier City', 5), ('Woodbury', 4), ('Boston', 5), ('Pittsburg', 5), ('San Ramon', 5), ('Reno', 5), ('Topeka', 5), ('Newport News', 5), ('Poinciana', 5), ('Compton', 5), ('Cedar Park', 5), ('Merced', 5), ('Shreveport', 5), ('Palatine', 4), ('San Angelo', 5), ('Passaic', 4), ('Lake Charles', 5), ('North Richland Hills', 5), ('Boise', 5), ('Carmel', 4), ('Palmdale', 5), ('Baltimore', 5), ('Indio', 5), ('Florence-Graham', 3), ('Santa Clarita', 5), ('Buena Park', 5), ('San Clemente', 4), ('Lawrence', 9), ('Downey', 5), ('Lafayette', 9), ('Newport Beach', 4), ('Schenectady', 5), ('South Gate', 5), ('Brownsville', 5), ('Costa Mesa', 5), ('Tyler', 5), ('Napa', 5), ('Centennial', 5), ('Sunrise', 4), ('Tucson', 5), ('Fullerton', 5), ('Lake Forest', 5), ('Stockton', 5), ('San Antonio', 5), ('Orem', 5), ('Norman', 5), ('Youngs', 5), ('Hayward', 5), ('Sandy', 5), ('Moreno Valley', 5), ('Delray Beach', 4), ('Gresham', 5), ('Federal Way', 5), ('Waterloo', 5), ('Jersey City', 5), ('Mission Viejo', 5), ('Dale City', 5), ('Albuquerque', 5), ('Plano', 5), ('Hesperia', 5), ('Lehigh Acres', 5), ('Pawtucket', 5), ("Town 'n' Country", 5), ('Saint Cloud', 5), ('Midland', 5), ('Chicago', 5), ('Knoxville', 5), ('Westland', 5), ('Yuma', 5), ('Roanoke', 5), ('Rialto', 5), ('Pomona', 5), ('Warner Robins', 5), ('East Los Angeles', 5), ('Simi Valley', 5), ('Davenport', 5), ('Thornton', 5), ('Gary', 5), ('Palm Coast', 5), ('Hialeah', 4), ('Clifton', 5), ('Bellflower', 5), ('Broomfield', 5), ('Joliet', 5), ('San Francisco', 5), ('Camarillo', 5), ('Skokie', 4), ('Redwood City', 5), ('Evansville', 5), ('Hillsboro', 5), ('The Woodlands', 5), ('Longview', 5), ('Upland', 5), ('Sunrise Manor', 5), ('Lubbock', 5), ('Kirkland', 5), ('Garden Grove', 5), ('Baton Rouge', 5), ('Livermore', 5), ('Paterson', 5), ('Conroe', 5), ('Edmond', 5), ('Sacramento', 5), ('Detroit', 5), ('Ontario', 5), ('Alameda', 5), ('Clovis', 5), ('Gilbert', 5), ('Hammond', 5), ('Saint Louis', 5), ('Athens-Clarke County unified government', 5), ('Scranton', 4), ('Modesto', 5), ('Perris', 4), ('South Jordan', 3), ('Visalia', 5), ('Davis', 5), ('Gaithersburg', 5), ('Albany', 10), ('Plymouth', 5), ('Corona', 5), ('Rochester', 10), ('Oshkosh', 5), ('Baldwin Park', 5), ('Oakland', 5), ('Augusta-Richmond County consolidated government', 5), ('Salem', 5), ('Schaumburg', 5), ('Lowell', 5), ('Glen Burnie', 5), ('Bend', 5), ('Bridgeport', 5), ('Broken Arrow', 5), ('New Orleans', 5), ('Arlington', 10), ('Bellevue', 5), ('Irving', 5), ('Whittier', 5), ('Bay', 5), ('Loveland', 5), ('Mount Pleasant', 4), ('Hemet', 5), ('Franklin', 4), ('Sugar Land', 4), ('Murrieta', 5), ('Miami', 5), ('Apple Valley', 5), ('Macon', 5), ('Cleveland', 5), ('Tempe', 5), ('Southfield', 5), ('Durham', 5), ('Pharr', 3), ('Spokane Valley', 5), ('Grand Rapids', 5), ('Sunnyvale', 5), ('Fort Lauderdale', 5), ('Warwick', 4), ('Canton', 4), ('Lansing', 5), ('Mayagüez', 2), ('Laguna Niguel', 4), ('Pine Hills', 4), ('New York', 5), ('Mobile', 5), ('League City', 4), ('Guaynabo', 2), ('Missoula', 5)]
There's 565 duplicated rows in city in the table dim_demo_stat

In [158]:
duplicate_query = """
    SELECT dt, COUNT(dt)
    FROM dim_temp
    GROUP BY dt
    HAVING COUNT(dt)>1;
"""
cur.execute(duplicate_query)
data = cur.fetchall()
print(data)

if not data:
    print("There's no duplicated rows")
else:
    print(f"There's {len(data)} duplicated rows in dt in the table dim_temp")

[]
There's no duplicated rows

#### Checking if the rows exist after inserting data

In [106]:
query = "SELECT COUNT(*) FROM fact_immigration;"
cur.execute(query) 
data = cur.fetchall()
print(data)

if data[0][0] < 1:
    print("No data found in table fact_immigration")
else:
    print(f"Successfully executed with {data[0][0]} records in the table fact_immigration!")

[(2000,)]
Successfully executed with 2000 records in the table dim_demo_stat!!

In [107]:
query = "SELECT COUNT(*) FROM dim_immigration_personal;"
cur.execute(query) 
data = cur.fetchall()
print(data)

if data[0][0] < 1:
    print("No data found in table dim_immigration_personal")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_immigration_personal!!")

[(2000,)]
Successfully executed with 2000 records in the table dim_immigration_personal!!

In [108]:
query = "SELECT COUNT(*) FROM dim_immigration_air;"
cur.execute(query) 
data = cur.fetchall()
print(data)

if data[0][0] < 1:
    print("No data found in table dim_immigration_air")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_immigration_air!!")

[(2574,)]
Successfully executed with 2574 records in the table dim_immigration_air!!

In [109]:
query = "SELECT COUNT(*) FROM dim_demo_info;"
cur.execute(query) 
data = cur.fetchall()
print(data)

if data[0][0] < 1:
    print("No data found in table dim_demo_info")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_demo_info!!")

[(2891,)]
Successfully executed with 2891 records in the table dim_demo_info!!

In [110]:
query = "SELECT COUNT(*) FROM dim_demo_stat;"
cur.execute(query) 
data = cur.fetchall()
print(data)

if data[0][0] < 1:
    print("No data found in table dim_demo_stat")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_demo_stat!!")

[(2891,)]
Successfully executed with 2891 records in the table dim_demo_stat!!

In [111]:
query = "SELECT COUNT(*) FROM dim_temp;"
cur.execute(query) 
data = cur.fetchall()
print(data)

if data[0][0] < 1:
    print("No data found in table dim_temp")
else:
    print(f"Successfully executed with {data[0][0]} records in the table dim_temp!!")

[(2000,)]
Successfully executed with 2000 records in the table dim_temp!!

#### 4.3 Data dictionary 
__Fact Table__
- fact_immigration<br>
`cic_id` : <br>
`year` :<br>
`month` :<br>
`dep_city` :<br>
`arrival_date` :<br>
`dep_date` :<br>
`travel_code` :<br>
`visa` :<br>

__Dimension Tables__
- dim_immigration_personal<br>
`cic_id` :<br>
`citizen_country` : <br>
`resident_country` : <br>
`birthyear` : <br>
`gender` : <br>
`ins_number` : <br>

- dim_immigration_air<br>
`cic_id` : <br>
`airline` : <br>
`admin_number` : <br>
`flight_number` : <br>
`visa` : <br>
`visa_type` : <br>

- dim_temp<br>
'dt', 'avg_temp', 'avg_temp_uncertainty', 'city', 'country', 'latitude', 'longitude'
- dim_demo_info<br>
'city', 'state', 'm_population', 'f_population', 'total_population', 'num_of_veterans', 'foreign_born', 'state_code', 'race'
- dim_demo_stat<br>
'city', 'state', 'median_age', 'avg_household_size', 'state_code'

#### Step 5: Complete Project Write Up
* Clearly state the rationale for the choice of tools and technologies for the project.
* Propose how often the data should be updated and why.
* Write a description of how you would approach the problem differently under the following scenarios:
 * The data was increased by 100x.
 * The data populates a dashboard that must be updated on a daily basis by 7am every day.
 * The database needed to be accessed by 100+ people.